{
  "votes": [
    {
      "stars": 1,
      "sessionId": "2249b828"
    },
    {
      "stars": 1,
      "sessionId": "b3137968-3f38-3280-a20f-03e15cb338d7"
    },
    {
      "stars": 1,
      "sessionId": "3ce6afb2-dae1-37c6-a414-8f81c3d8abdc"
    },
  ],
  "sessions": [
    {
      "id": "2249b828",
      "tags": [
        "conference",
        "en",
        "hacker",
        "securitybestpractices"
      ],
      "description": "You've seen big data breaches in the news. But as a developer who doesn't specialize in security you might find it hard to protect yourself from becoming the next victim. In this talk, you'll learn the most common reasons that some systems get hacked and what practical measures you can take as a developer to keep your apps safe.",
      "length": 50,
      "speakerNames": [
        "Joe Kutner"
      ],
      "title": "10 Mistakes Hackers Want You to Make"
    },
    {
      "id": "6a0d33ac",
      "tags": [
        "ecosystem",
        "en",
        "history",
        "quickie",
        "spring"
      ],
      "description": "The Spring Framework originated from a book in 2002, becoming the most widely used application framework in the entire Java ecosystem within a few years... and holding that position to this day. This talk illustrates Spring's evolution over 15 years, adapting not only to five new JDK generations but also to ever-changing requirements in modern enterprise architectures.",
      "length": 15,
      "speakerNames": [
        "Juergen Hoeller"
      ],
      "title": "15 Years of Spring (in 15 Minutes)"
    },
    {
      "id": "0ca88003",
      "tags": [
        "career",
        "en",
        "life",
        "quickie"
      ],
      "description": "As developers we are committed to a life of learning. With all the new technologies and paradigms changing so fast, more conferences and meetups than you can attend, other people doing cool stuff, you can feel overwhelmed and have a fear of missing out. You are not alone! We'll dive into what motivates us and walk through ways of dealing with this and give direction to expanding our knowledge and skills.",
      "length": 15,
      "speakerNames": [
        "Tom Wetjens"
      ],
      "title": "4 Ways to deal with Fear Of Missing Out"
    },
    {
      "id": "46fb4475-7468-3cbe-9046-c771cae19e53",
      "tags": [
        "cloudnativejava",
        "deepdive",
        "en",
        "kubernetes"
      ],
      "description": "Everybody seems to be rocking with Kubernetes! Even your favorite repos at GitHub are running on top of it. Don't be the last developer/architect to board this bullet train. Come and learn a LOT in this session about Kubernetes - from getting started to staying productive.\r\n\r\nWe will provide numerous practical tips & techniques that will take you from cloud newbie to cloud native.\r\n\r\n- Installation & Getting Started\r\n- Building & Running Linux container Images \r\n- Your JVM goes boom - OOMKilled in Kubernetes\r\n- Peering inside your container\r\n- Streaming logs\r\n- IDEs and Debugging\r\n- Load-balancing and service discovery \r\n- Configuration management\r\n- Blue/green and Canary deployments\r\n- Istio Service Mesh for advanced microservices architecture\r\n",
      "length": 180,
      "speakerNames": [
        "Burr Sutter"
      ],
      "title": "9 Steps to Awesome with Kubernetes"
    },
    {
      "id": "854479d2-1c15-3dec-a1ff-c44a9041b3a2",
      "tags": [
        "architecture",
        "conference",
        "en",
        "microservices",
        "tdd",
        "testing"
      ],
      "description": "Micro-services are the new black; everyone is using them. Alas, when your system is composed of many micro-services, testing becomes more challenging. The straight-forward approach for E2E testing no longer suffices and for integration tests it doesn’t even exist. A better way to test in this kind of an environment would be to work with a test kit of the micro-service you are interacting with.\r\nBy the end of this talk, you will learn how to create a test-kit that covers your micro-service. Testing this way will grant you a much higher level of confidence, and will portray a more accurate picture of your assumptions vs. reality. Overall it will make any integration between micro-services easier, thus benefit your colleagues and make your company progress faster.",
      "length": 50,
      "speakerNames": [
        "Maxim Novak"
      ],
      "title": "A Better Approach for Testing Micro-Services – Introducing: Test Kits in Practice"
    },
    {
      "id": "dbb788e3-a955-3979-8db3-22550bcb0cc9",
      "tags": [
        "en"
      ],
      "description": "Your brain is a ruthless despot. It just doesn’t want to let your ideas and thoughts out. But it has a weak spot. It’s susceptible to brain hacks. Let’s set your ingenuity free by coercing your brain to cast the creative flood gates wide open.\r\n\r\nI’m back to share with you a dozen hacks I use to get my brain to write fluently. Centered around the AsciiDoc markup language, we’ll explore tricks such as starting with the action, zen writing mode, the WORKLOG, the content fly trap, communicating with links, collaborative editing, and more!\r\n\r\nThese tricks you play on your brain helps keeps you in writing flow and the cursor racing across the screen. After attending this session, the blank page will be your oyster instead of your nemesis.",
      "length": 30,
      "speakerNames": [
        "Dan Allen"
      ],
      "title": "A Dozen Ways to Hack Your Brain to Write Fluently"
    },
    {
      "id": "fb655971-64a4-3697-8168-1406308d20b0",
      "tags": [
        "blockchain",
        "composer",
        "deepdive",
        "en",
        "fabric",
        "hyperledger"
      ],
      "description": "Today in our tutorial session using a case study technique we will have a brief description of Hyperledger Composer, its capabilities, and its role in the modeling and implementing a Blockchain application. Then a closer look at Hyperledger Fabric and a typical Blockchain solution Architecture. After that a description of the elements of a business network, role of channels, and how world state is maintained. Exploring An explanation of how consensus works, endorsement, and ordering work in Hyperledger Fabric operates. Then touch Hyperledger Composer and Hyperledger Fabric security. A description of the different possible deployment options of Blockchain solutions including local, on IBM Container Service, and IBM Blockchain Platform.",
      "length": 180,
      "speakerNames": [
        "Ahmad Gohar"
      ],
      "title": "A journey to Build a Distributed Blockchain Application"
    },
    {
      "id": "95d973d3-0527-3307-a4be-6ecc963084d7",
      "tags": [
        "conference",
        "devoxxsponsor",
        "en"
      ],
      "description": "AWS reserved partner slot",
      "length": 50,
      "speakerNames": [
        "Devoxx Partner"
      ],
      "title": "AWS partner slot"
    },
    {
      "id": "60920ae3-7d34-39b9-9b75-33b5054b7674",
      "tags": [
        "ci/cdpractices",
        "conference",
        "containerizedmicroservices",
        "devops",
        "en",
        "kubernetes"
      ],
      "description": "We all want to become high performing teams delivering real business value quickly! This talk will show you how you can go faster by automating:\r\n\r\n* setting up your CI/CD so you can spin up new microservices in seconds\r\n* packaging of your application as container images and helm charts so it can be deployed easily on any cluster\r\n* automatic or manual promotion of your application through Testing, Staging and Production via GitOps\r\n* using Preview environments to get fast feedback on code changes at Pull Request before you merge them and without blocking urgent bug fixes\r\n* lots of feedback and metrics to help you improve\r\n\r\nThis talk will introduce you to the Jenkins X project which automates your CI/CD on any Kubernetes cluster. \r\n\r\nAfter this talk you should be able to develop at full speed with CI/CD in a cloud native way in any language on any cloud using kubernetes! Lets all go faster!\r\n",
      "length": 50,
      "speakerNames": [
        "James Strachan"
      ],
      "title": "Accelerate your CI/CD on Kubernetes with Jenkins X"
    },
    {
      "id": "c7c55885-ede8-3ef4-82f2-66f401a31439",
      "tags": [
        "agile",
        "conference",
        "culture",
        "en",
        "inspiration"
      ],
      "description": "Any country that has \"Democratic\" in its official name ISN'T democratic. Any organisation that tells you that it is \"doing Agile\" ISN'T doing Agile. I noticed the first as I was growing up during the Cold War. The second truth I've discovered in the last few years working as a consultant for ThoughtWorks.\r\n\r\nHow do you teach Agile to a group of people who think they are already doing Agile? How do you explain to a business that thinks that \"Agile doesn't work\" that the reason why it isn't working is because IT has to change as well as the technology group? How do you even begin to do this when everybody you meet thinks that they've \"tried this all before, it just doesn't work here!\"\r\n\r\nWe've worked under these conditions and we've had success in effecting real change both at ground level and throughout the wider business. In this talk I'll share some techniques that we've successfully used.",
      "length": 50,
      "speakerNames": [
        "James Birnie"
      ],
      "title": "Agile is a Dirty Word"
    },
    {
      "id": "850f32f4-fa7c-31d8-81c7-26a0ec1a86ac",
      "tags": [
        "angular",
        "applicationarchitecture",
        "conference",
        "en",
        "performance",
        "typescript"
      ],
      "description": "The Angular team is constantly working to improve the performance and decrease the code size of applications built with our framework. Most of the time, these improvements come about gradually as the result of many small optimizations. Once in a while, though, a radical redesign of the framework's internals will bring about a major leap, often without changing a single line of application code.\r\n\r\nThis is the goal of the Angular Ivy project - to build a new rendering architecture for one of the web's largest frameworks. At its core is an instruction set for rendering Angular templates, integrated into the framework using set of techniques and design patterns that leverage the capabilities of the modern ES6 ecosystem, taking full advantage of transpilers, bundlers, and tree-shakers. Ivy is a way of thinking about application design that's applicable to any application, large or small.\r\n\r\nThis talk covers the design and philosophy of Angular Ivy from its instructions on up. It will illustrate exactly how the new architecture achieves major gains in performance and code size, and show you how to apply these same techniques to your own applications.",
      "length": 50,
      "speakerNames": [
        "Alex Rickabaugh"
      ],
      "title": "An instruction set for the web"
    },
    {
      "id": "771a327f-0ca5-3135-ad85-6a49fbb68a6f",
      "tags": [
        "collaboration",
        "documentation",
        "en",
        "quickie",
        "websites",
        "workflow"
      ],
      "description": "Your documentation gives users a first impression of your software; its “curb appeal”. How do you create it? How do you manage it? How do you publish it? What about versions?\r\n\r\nDespite there being countless site generators to choose from, few are well-suited for large-scale documentation sites, and none designed exclusively for AsciiDoc. Writers need the ability to create and manage documentation sites without needing deep knowledge of the web stack. Software teams need a workflow to collaborate on multiple versions of documentation that span departments. By creating Antora, we set out to fill these gaps. I’ll explain how we architected Antora and how it changes the way we think about producing documentation.\r\n\r\nAntora aggregates versioned content from a variety of repositories and branches that adhere to a standard project structure. It then converts that content and feeds it to a UI, which is provided by a separate software component. Out comes an offline-first site that can be published and viewed anywhere, even locally.\r\n\r\nThis talk will give you an understanding of how Antora enables software teams to effectively create, manage, and publish multi-version documentation sites.",
      "length": 15,
      "speakerNames": [
        "Dan Allen"
      ],
      "title": "Antora: Documentation Sites for Software Teams"
    },
    {
      "id": "28d23cbc-d598-3928-89ee-5fcdc0a6ec66",
      "tags": [
        "en"
      ],
      "description": "Have you ever thought that you needed to be a programmer to do stream processing and build streaming data pipelines? Think again! Apache Kafka is a distributed, scalable, and fault-tolerant streaming platform, providing low-latency pub-sub messaging coupled with native storage and stream processing capabilities. Integrating Kafka with RDBMS, NoSQL, and object stores is simple with Kafka Connect, which is part of Apache Kafka. KSQL is the open-source SQL streaming engine for Apache Kafka, and makes it possible to build stream processing applications at scale, written using a familiar SQL interface.\r\n\r\nIn this talk we’ll explain the architectural reasoning for Apache Kafka and the benefits of real-time integration, and we’ll build a streaming data pipeline using nothing but our bare hands, Kafka Connect, and KSQL.\r\n\r\nGasp as we filter events in real time! Be amazed at how we can enrich streams of data with data from RDBMS! Be astonished at the power of streaming aggregates for anomaly detection!",
      "length": 30,
      "speakerNames": [
        "Robin Moffatt"
      ],
      "title": "Apache Kafka and KSQL in Action : Let’s Build a Streaming Data Pipeline!"
    }
  ],
  "starsLeft": 2,
  "starsTotal": 20,
  "isVotingActive": true
}